![img](../data/images.png)

# TP2 Analyse de données  &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 2022_2023
-------

## Exercice 1 :
1. Importer la bibliothèque `sqlite3` et la bibliothèque `pandas` avec l'alias `pd`.

2. Créer une connection `conn` en pointant le fichier `customer_sales.db'` se trouvant dans le chemin `/data/source/ `. 

3. Créer le data frame **df_sales** à partir de la connection faite en a.
    
4. Donner l'index de **df_sales**.
    
5. Changer l'index de **df_sales** en `Sales_Id`.
    
6. Afficher les $2$ premières ligne du dataframe **df_sales**.
    
7. Inspecter les informations de **df_sales** ( utiliser `df.info` ). Y-a-t il des données manquantes?

8. Trier **df_sales** selon la colonne `Sale_date` par ordre croissant. Donner la description de l'achat le plus récent ?
9. Séléctionner toutes les données de **df_sales** tels que `['Sales_Amount'] > 100`.
10. Séléctionner toutes les données de **df_sales** tels que `['Sales_Quantity'] =1`.

### Réponse à la question 3 ( Code SQL)

* Installer `ipython-sql` avec la commande : 
```python
!pip install ipython-sql
``` 
* Exécuter dans une autre cellules
> ```python
%%capture
%load_ext sql
%sql sqlite:///customer_sales.db
```
* Puis
>```python
%%sql
select * from tbl_sales
where Sales_Amount > 100
```

In [2]:
pip install ipython-sql

^C
Note: you may need to restart the kernel to use updated packages.

In [ ]:
%%capture
%load_ext sql
%sql sqlite:///customer_sales.db

ModuleNotFoundError: No module named 'sql'

In [ ]:
%%sql
select * from tbl_sales
where Sales_Amount > 100

UsageError: Cell magic `%%sql` not found.

### Espace résérvé à la correction 

* Q1

In [ ]:
import sqlite3

In [ ]:
import pandas as pd

* Q2

In [ ]:
conn= sqlite3.connect('../data/source/customer_sales.db')

* Q3

In [ ]:
cursor = conn.cursor()
cursor.execute("SELECT name FROM sqlite_master WHERE type = 'table';")
print(cursor.fetchall())

[('CLIENTS2',), ('tbl_customers3',), ('tbl_products',), ('tbl_sales',), ('tbl_customers',)]

* Q4

In [ ]:
df_sales= pd.read_sql_query("SELECT * FROM tbl_sales" ,conn)
df_sales

,Sale_ID,Sale_Date,Description,Customer_ID,Product_ID,Sales_Amount,Sales_Quantity
0,1,12/31/2014,Purchased from Store,2,2,20,1
1,2,1/15/2015,Phone Purchase,1,1,30,2
2,3,6/14/2015,Internet Purchase,3,3,5,1
3,4,11/11/2015,Sales Convention Purchase,3,3,500,100
4,5,4/18/2016,Internet Purchase,4,1,20,2
5,6,10/15/2016,Purchased from Store,5,1,20,1
6,7,3/17/2017,Internet Purchase,4,1,20,1
7,8,6/15/2018,Purchased from Store,3,3,5,1
8,9,5/25/2019,Internet Purchase,1,3,10,2
9,10,6/9/2019,Internet Purchase,2,3,10,2

* Q5

In [ ]:
df_sales.index 
# pandas index

RangeIndex(start=0, stop=10, step=1)

* Q6

In [ ]:
df_sales= pd.read_sql_query("SELECT * FROM tbl_sales" ,conn,index_col='Sale_ID')
df_sales

,Sale_Date,Description,Customer_ID,Product_ID,Sales_Amount,Sales_Quantity
Sale_ID,,,,,,
1,12/31/2014,Purchased from Store,2,2,20,1
2,1/15/2015,Phone Purchase,1,1,30,2
3,6/14/2015,Internet Purchase,3,3,5,1
4,11/11/2015,Sales Convention Purchase,3,3,500,100
5,4/18/2016,Internet Purchase,4,1,20,2
6,10/15/2016,Purchased from Store,5,1,20,1
7,3/17/2017,Internet Purchase,4,1,20,1
8,6/15/2018,Purchased from Store,3,3,5,1
9,5/25/2019,Internet Purchase,1,3,10,2
10,6/9/2019,Internet Purchase,2,3,10,2

* Q7

In [ ]:
df_sales.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 10 entries, 1 to 10
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Sale_Date       10 non-null     object
 1   Description     10 non-null     object
 2   Customer_ID     10 non-null     int64
 3   Product_ID      10 non-null     int64
 4   Sales_Amount    10 non-null     int64
 5   Sales_Quantity  10 non-null     int64
dtypes: int64(4), object(2)
memory usage: 560.0+ bytes

* Q8

In [ ]:
df_sales["Sale_Date"] = pd.to_datetime(df_sales["Sale_Date"] )
df_sales.sort_values(by='Sale_Date')

,Sale_Date,Description,Customer_ID,Product_ID,Sales_Amount,Sales_Quantity
Sale_ID,,,,,,
1,2014-12-31,Purchased from Store,2,2,20,1
2,2015-01-15,Phone Purchase,1,1,30,2
3,2015-06-14,Internet Purchase,3,3,5,1
4,2015-11-11,Sales Convention Purchase,3,3,500,100
5,2016-04-18,Internet Purchase,4,1,20,2
6,2016-10-15,Purchased from Store,5,1,20,1
7,2017-03-17,Internet Purchase,4,1,20,1
8,2018-06-15,Purchased from Store,3,3,5,1
9,2019-05-25,Internet Purchase,1,3,10,2
10,2019-06-09,Internet Purchase,2,3,10,2

In [ ]:
df_sales.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 10 entries, 1 to 10
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Sale_Date       10 non-null     datetime64[ns]
 1   Description     10 non-null     object
 2   Customer_ID     10 non-null     int64
 3   Product_ID      10 non-null     int64
 4   Sales_Amount    10 non-null     int64
 5   Sales_Quantity  10 non-null     int64
dtypes: datetime64[ns](1), int64(4), object(1)
memory usage: 560.0+ bytes

* Q9

In [ ]:
df_sales[df_sales['Sales_Amount']>100]

,Sale_Date,Description,Customer_ID,Product_ID,Sales_Amount,Sales_Quantity
Sale_ID,,,,,,
4,2015-11-11,Sales Convention Purchase,3,3,500,100

* Q10

In [ ]:
df_sales[df_sales['Sales_Quantity']==1]

,Sale_Date,Description,Customer_ID,Product_ID,Sales_Amount,Sales_Quantity
Sale_ID,,,,,,
1,2014-12-31,Purchased from Store,2,2,20,1
3,2015-06-14,Internet Purchase,3,3,5,1
6,2016-10-15,Purchased from Store,5,1,20,1
7,2017-03-17,Internet Purchase,4,1,20,1
8,2018-06-15,Purchased from Store,3,3,5,1

## EXERCICE 2 :

> * Corriger les erreurs éventuelles
> * Interpréter et commenter chaque ligne de code

In [ ]:
import pandas as pd

In [ ]:
df_user_churn_cleaned = pd.read_csv('../data/source/user_hits_binning_import.csv', parse_dates=['date'])

In [ ]:
df_user_churn_cleaned.head(10)

   userid       date
0       1 2017-01-01
1       2 2017-01-02
2       3 2017-01-03
3       4 2018-01-01
4       5 2018-01-02
5       6 2018-10-03
6       1 2019-10-01
7       3 2019-10-02
8       7 2019-10-03
9       8 2020-01-01

In [ ]:
df_user_churn_cleaned.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   userid  12 non-null     int64
 1   date    12 non-null     datetime64[ns]
dtypes: datetime64[ns](1), int64(1)
memory usage: 320.0 bytes

In [ ]:
from datetime import datetime
import numpy as np

In [ ]:
df_user_churn_cleaned['age'] = (datetime.now() - pd.to_datetime(df_user_churn_cleaned['date'])).dt.days
datetime.now()

datetime.datetime(2022, 10, 4, 10, 50, 8, 826118)

In [ ]:
df_user_churn_cleaned

    userid       date   age
0        1 2017-01-01  2102
1        2 2017-01-02  2101
2        3 2017-01-03  2100
3        4 2018-01-01  1737
4        5 2018-01-02  1736
5        6 2018-10-03  1462
6        1 2019-10-01  1099
7        3 2019-10-02  1098
8        7 2019-10-03  1097
9        8 2020-01-01  1007
10       1 2020-01-02  1006
11       2 2020-01-03  1005

In [ ]:
df_ages = df_user_churn_cleaned.groupby('userid').max()

NameError: name 'df_user_churn_cleaned' is not defined

In [ ]:
df_ages

             date   age
userid
1      2020-01-02  2102
2      2020-01-03  2101
3      2019-10-02  2100
4      2018-01-01  1737
5      2018-01-02  1736
6      2018-10-03  1462
7      2019-10-03  1097
8      2020-01-01  1007

In [ ]:
365*5

1825

In [ ]:
df_ages['age_bin'] = pd.cut(x=df_ages['age'], bins=[1, 1094, 1825, 9999], labels=['< 3 year', '3 to 5 years', '> 5 years'])

In [ ]:
#df_ages['age_by_decade'] = pd.cut(x=df_ages['age'], bins=[__, __, __], labels=['< 1 year', '1 to 2 years', '> 3 years'])

In [ ]:
#df_user_churn_cleaned['day_of_week_in_number'] = pd.df_user_churn_cleaned['date'].dt.dayofweek

In [ ]:
df_ages

             date   age       age_bin
userid
1      2020-01-02  2102     > 5 years
2      2020-01-03  2101     > 5 years
3      2019-10-02  2100     > 5 years
4      2018-01-01  1737  3 to 5 years
5      2018-01-02  1736  3 to 5 years
6      2018-10-03  1462  3 to 5 years
7      2019-10-03  1097  3 to 5 years
8      2020-01-01  1007      < 3 year

In [ ]:
df_grouped = df_ages.groupby('age_bin').count()

In [ ]:
df_grouped

              date  age
age_bin
< 3 year         1    1
3 to 5 years     4    4
> 5 years        3    3

In [ ]:
df_grouped.drop(['date'], axis=1)
# axis=1 ==> colonne
# axis= 0 ==> ligne

              age
age_bin
< 3 year        1
3 to 5 years    4
> 5 years       3

In [ ]:
df_grouped.rename(columns={'age': 'user count'}, inplace=True)
# inplace=True ==>modifier dans la meme place (ecraser la 1ére valeur)

In [ ]:
df_grouped

              date  user count
age_bin
< 3 year         1           1
3 to 5 years     4           4
> 5 years        3           3

In [ ]:
df_grouped.drop(['date'], axis=1)

|Commande           | Description                            |
|-------------------|----------------------------------------|
|.to_datetime(): | convertir l'argument entre paranthése en date sous format jj-mm-aaaa
.sort_values(by='xxx')| trier selon le paramétre entre paranthése
.groupby('xxx')| Regroupez une DataFrame selon xxx
.max()| donner la valeur maximale
.cut():|segmenter et trier des valeurs données.
.count()|compter le nombre de valeurs non vides pour chaque ligne ou colonne
.drop(['xxx'], axis=1)| supprimer la colonne xxx
.rename(columns={'xxx': 'aaa'}, inplace=True):| renomer la colonne xxx par aaa et écraser xxx